src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СК_МобСклад/Forms/ФормаПоступления/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ШКНоменклатурыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПоискНоменклатурыШК(Текст); 
	Если ЭтаФорма.Номенклатура <> "" Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискШКЯчейки();
		//ПодключитьОбработчикОжидания("АктивироватьПоискШКЯчейки",5,Истина);
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ПоискНоменклатурыШК(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();

	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Номенклатура не найдена";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Ячейка = Рез[0].Ссылка;
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "";
	Иначе
		ЭтаФорма.Ячейка = "";
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "Ячейка не найдена";
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеБуфер(Параметры) Экспорт  
	ПослеЗакрытияПредупреждениеНаСервереБуфер();
	АктивироватьПоискШКЯчейки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияПредупреждениеНаСервереБуфер()
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
    ЭтаФорма.Вналичии = 0;
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	
	Если Текст = "0000000000001" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"В буфер принимать нельзя!!! ",5,"Ошибка");
		
	Иначе	
		ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст); 
		Если ЭтаФорма.Ячейка <> "" Тогда
			ЭтаФорма.Элементы.Вналичии.РедактированиеТекста = Истина;
			АктивироватьВналичии();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПринятьНаСервере()
	Если ЭтаФорма.Номенклатура.Ссылка.Пустая() =  Ложь И ЭтаФорма.Ячейка.Ссылка.Пустая() = Ложь И ЭтаФорма.Вналичии >=0.01 Тогда 
		ЯчейкаОтправитель = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод","0000000000001").Ссылка;
		ТабКол = Обработки.СК_МобСклад.ПолучитьОстатокНоменклатураЯчейка(ЭтаФорма.Номенклатура,
																		ЯчейкаОтправитель);
		Если ЭтаФорма.Вналичии <= ТабКол.Итог("ВналичииОстаток") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	СК_Перемещение.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.СК_Перемещение КАК СК_Перемещение
			|ГДЕ
			|	СК_Перемещение.ПометкаУдаления = &ПометкаУдаления
			|	И СК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И СК_Перемещение.Проведен = &Проведен"; 
			Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
			Запрос.УстановитьПараметр("Проведен", Истина);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
			
			Рез = Запрос.Выполнить().Выбрать();
			
			Если Рез.Следующий() Тогда
				ТекДок = Рез.Ссылка.ПолучитьОбъект();
			Иначе
				ТекДок = Документы.СК_Перемещение.СоздатьДокумент(); 
				ТекДок.Дата =ТекущаяДата(); 
			КонецЕсли; 
			
			НоваяСтрока = ТекДок.Товары.Добавить();
			НоваяСтрока.Номенклатура = ЭтаФорма.Номенклатура;

			НоваяСтрока.Количество = ЭтаФорма.Вналичии;
			НоваяСтрока.Время = ТекущаяДата(); 
			НоваяСтрока.ЯчейкаОтправитель = ЯчейкаОтправитель;
			НоваяСтрока.ЯчейкаПриемник = ЭтаФорма.Ячейка;;
			
			Попытка                                              
				ТекДок.Записать(РежимЗаписиДокумента.Проведение);  
				ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
				Возврат Истина;
			Исключение
				Возврат Ложь;
			Конецпопытки;	
		Иначе 
			ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Количество больше чем в буфере";
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Заполните все поля";
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Принять(Команда)
	О = ПринятьНаСервере();
	Если О = Истина Тогда
		//ЭтаФорма.Закрыть();
		
		ЭтаФорма.Элементы.ИнфоПринято.Заголовок = "Принято";
		ЭтаФорма.Элементы.ИнфоПринято.ЦветТекста = WEBЦвета.Зеленый;
		ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина; 
		ОстТовара = ОстатокТовара();
		ТоварПринят = Строка(ЭтаФорма.Номенклатура) + Символы.ПС +
						"размещена в " + Строка(ЭтаФорма.Ячейка) + Символы.ПС +
						"кол-во :" + Строка(ЭтаФорма.Вналичии);
		Если ОстТовара>0 ТОгда
			ТоварПринят = ТоварПринят + Символы.ПС + Строка("Итого по складу: ") + Строка(ОстТовара);
		КонецЕсли;
						
					  	
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,Строка(ТоварПринят),5,"Принято!!!");
		
	Иначе
		ЭтаФорма.Элементы.ИнфоПринято.Заголовок = "Ошибка";
		ЭтаФорма.Элементы.ИнфоПринято.ЦветТекста = WEBЦвета.Красный;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОстатокТовара()
	Ост = 0;
	ТабОстаток = Обработки.СК_МобСклад.ПолучитьОстаток(ЭтаФорма.Номенклатура);
	Если ТабОстаток.Количество() >=1 Тогда 
		Ост = ТабОстаток.Итог("ВналичииОстаток");
	КонецЕсли;
	
	Возврат Ост;
	
КонецФункции



&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт  
	ПослеЗакрытияПредупреждениеНаСервере();
	АктивироватьПоиск();
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияПредупреждениеНаСервере()
	
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
    ЭтаФорма.Вналичии = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина;
	АктивироватьПоиск();
	//ПодключитьОбработчикОжидания("АктивироватьПоиск",5,Истина);
	
КонецПроцедуры   

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКНоменклатуры.ОбновитьТекстРедактирования();
	Элементы.ШКНоменклатуры.Видимость = Ложь;
	Элементы.ШКНоменклатуры.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКНоменклатуры; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКНоменклатуры = "";
КонецПроцедуры


///////////
&НаКлиенте
Процедура АктивироватьПоискШКЯчейки() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	ШКЯчейки = "";
КонецПроцедуры  

///////////
&НаКлиенте
Процедура АктивироватьВналичии() 
	ОчиститьШКСерверВналичии(); 
	Элементы.Вналичии.ОбновитьТекстРедактирования();
	Элементы.Вналичии.Видимость = Ложь;
	Элементы.Вналичии.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Вналичии; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверВналичии()
	Вналичии = 1;
КонецПроцедуры
